{
  "project": "FamSchedule",
  "branchName": "ralph/v1.4-features",
  "description": "FamSchedule v1.4 — nine stories: recurring-event expansion on the calendar, delete-conversation UX, notification cap, Today jump button, AI planner wired to real events, conflict warning on create/edit, month-view day-events popover, upcoming-events sidebar widget, and event search bar.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Expand recurring events into visible-range instances on the calendar",
      "description": "As a user, I want recurring events (daily, weekly, monthly, yearly) to appear on every matching day in the calendar instead of only on their creation date.",
      "acceptanceCriteria": [
        "src/utils/expandRecurrence.ts exists and exports getVisibleRange and expandRecurrence",
        "DashboardPage imports both, computes [rangeStart, rangeEnd] from calendarView + selectedDate, and passes expandRecurrence(allEvents, rangeStart, rangeEnd) to CalendarGrid",
        "Edit and delete on a recurring instance resolve the base event ID by splitting on '__r'",
        "CalendarGrid MonthView shows titled event pills (not dots), max 2 visible, +N more overflow link",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 1,
      "passes": true,
      "notes": "expandRecurrence.ts was already written; this story verified + committed it."
    },
    {
      "id": "US-002",
      "title": "Add deleteConversation action and trash button in conversation header",
      "description": "As a user, I want to delete an entire conversation so I can clean up my message list.",
      "acceptanceCriteria": [
        "useAppStore AppState declares deleteConversation: (conversationId: string) => void",
        "The action filters conversations by ID, matching the removeLocalEvent pattern",
        "MessagingPage reads deleteConversation and wires it to a handler with window.confirm",
        "A trash-can icon button appears in the active-conversation header (ml-auto)",
        "After deletion setActiveId(null) is called so the empty state renders",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Code was already written; this story verified + committed it."
    },
    {
      "id": "US-003",
      "title": "Cap notifications at 20, auto-dismiss older",
      "description": "As a user, I want the notification list to stay manageable so old notifications do not accumulate indefinitely.",
      "acceptanceCriteria": [
        "addNotification action applies .slice(0, 20) after prepending",
        "createSyncProposal inline notification array applies .slice(0, 20)",
        "addTextInvite inline notification array applies .slice(0, 20)",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Three notification-mutation sites, not one. All three capped."
    },
    {
      "id": "US-004",
      "title": "Add Today jump button to calendar navigation header",
      "description": "As a user, I want a one-click way to return to today's date when I have navigated away.",
      "acceptanceCriteria": [
        "A 'Today' pill button appears in the CalendarGrid nav header next to the date label",
        "The button is hidden when the current view already includes today (view-aware: day checks date, week checks Sun–Sat range, month checks month+year)",
        "Clicking calls setSelectedDate(new Date())",
        "Styled as px-2 py-0.5 text-xs text-orange-600 bg-orange-50 rounded-full",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 3,
      "passes": true,
      "notes": "isToday uses isSameDay for day view, getWeekDays().some() for week view."
    },
    {
      "id": "US-005",
      "title": "Wire real localEvents and googleCalendar events into AI Planner",
      "description": "As a user, I want the AI Planner to consider my actual calendar when suggesting times instead of treating my schedule as empty.",
      "acceptanceCriteria": [
        "AIPlannerPage no longer imports mockEvents",
        "It reads localEvents and googleCalendar from useAppStore",
        "allEvents = [...localEvents, ...googleCalendar.events] is computed",
        "findBestPersonalSlot is called with allEvents",
        "No unused imports or variables remain",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Show conflict warning banner in create/edit event modal",
      "description": "As a user, I want to see which existing events overlap when I am creating or editing an event so I can avoid double-booking.",
      "acceptanceCriteria": [
        "hasConflict is exported from src/utils/mockAI.ts",
        "CreateEventModal reads localEvents from the store",
        "conflictingEvents is computed by filtering [...localEvents, ...googleCalendar.events] for overlap with the candidate window, excluding self when editing",
        "An orange warning banner renders when conflictingEvents is non-empty, showing 'Time conflict' and a comma-separated list of titles",
        "The warning appears after the start/end time row and updates as form values change",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Candidate start/end parsed with same new Date(`${date}T${time}:00`) as handleSubmit to ensure apples-to-apples comparison."
    },
    {
      "id": "US-007",
      "title": "Month view day-events popover",
      "description": "As a user, I want to see all events for a day in month view without leaving the month, and to open event details or create a new event from that popover.",
      "acceptanceCriteria": [
        "Clicking a day cell in month view opens a popover (not CreateEventModal directly)",
        "Clicking '+N more' also opens the popover for that day",
        "The popover shows a full day label, event list with colored dot + title + time, and a '+ New event' button",
        "Clicking an event closes the popover and calls onEventClick",
        "Clicking '+ New event' closes the popover and calls onDayClick with the day at 9 AM",
        "Clicking outside the popover closes it (backdrop div)",
        "onMoreClick prop removed from MonthView; unused setCalendarView removed from CalendarGrid",
        "CalendarGrid outer wrapper uses overflow-visible in month view",
        "useState imported from 'react' in CalendarGrid.tsx",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Popover uses fixed-position centered card (same pattern as other modals). Backdrop div on z-40 catches outside clicks."
    },
    {
      "id": "US-008",
      "title": "Upcoming events widget in dashboard sidebar",
      "description": "As a user, I want to see my next few events at a glance in the sidebar without switching views.",
      "acceptanceCriteria": [
        "src/components/UpcomingEvents.tsx exists with events and onEventClick props",
        "Filters to events starting today through 7 days ahead, sorts by start, shows first 5",
        "Each row has a colored circle, title (truncated), and formatted time ('Today, …' or 'Feb 6, …')",
        "Empty state shows 'No upcoming events'",
        "Card uses frosted-glass style matching NotificationPanel",
        "DashboardPage renders it below NotificationPanel, passing allEvents (pre-expansion) and onEventClick={setSelectedEvent}",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 4,
      "passes": true,
      "notes": "allEvents (not expandedEvents) passed so recurring events show once at base date."
    },
    {
      "id": "US-009",
      "title": "Search bar that filters calendar events by title",
      "description": "As a user, I want to type into a search box and see only matching events on the calendar in real time.",
      "acceptanceCriteria": [
        "A search input appears in the DashboardPage controls row between ViewToggle and the notification bell",
        "The input has a magnifying-glass SVG icon on the left, styled rounded-full with focus:ring-orange-400",
        "searchQuery state filters expandedEvents by case-insensitive title match",
        "filteredEvents is passed to CalendarGrid",
        "Clearing the input restores all events",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 5,
      "passes": true,
      "notes": ""
    }
  ]
}
