{
  "project": "FamSchedule",
  "branchName": "ralph/v1.5-dashboard-discovery",
  "description": "FamSchedule v1.5 — five stories: color filter chips, source filter toggle, mini month navigator, grouped day-summary sidebar rewrite, and filter-state URL persistence.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Color filter chips in dashboard controls row",
      "description": "As a user, I want to click color chips to show only events of that color, so I can visually isolate event categories at a glance.",
      "acceptanceCriteria": [
        "src/components/FilterChips.tsx exists and exports a default FilterChips component",
        "FilterChips receives props: events (CalendarEvent[]), activeColors (string[]), onToggleColor ((color: string) => void), onClear (() => void)",
        "It computes unique colors from events, sorts them by color string, and renders one pill chip per color — each chip has a small colored circle and the count of events with that color in parentheses",
        "Active chips (color is in activeColors) render bg-orange-500 text-white; inactive chips render border border-gray-200 bg-white text-gray-600",
        "A 'Clear' link (text-xs text-orange-600 hover:text-orange-700) renders to the right of the chips only when activeColors.length > 0; clicking calls onClear",
        "DashboardPage declares activeColors state (string[], default []), renders <FilterChips> below the controls row, and sets onClear to () => setActiveColors([])",
        "DashboardPage derives colorFilteredEvents = activeColors.length === 0 ? expandedEvents : expandedEvents.filter(e => activeColors.includes(e.color))",
        "The existing searchQuery filter is applied AFTER colorFilteredEvents (search narrows the color-filtered set)",
        "filteredEvents passed to CalendarGrid reflects both activeColors and searchQuery",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Source filter segmented control (All / Local / Google)",
      "description": "As a user, I want to toggle between all events, only local events, and only Google Calendar events so I can see where each event came from.",
      "acceptanceCriteria": [
        "DashboardPage declares sourceFilter state typed as 'all' | 'local' | 'google', defaulting to 'all'",
        "A segmented control matching the ViewToggle pattern (flex bg-white rounded-lg shadow-sm border border-gray-200 overflow-hidden; active button bg-orange-500 text-white; inactive text-gray-600 hover:bg-gray-50) renders in the controls row to the left of the search input",
        "The control has buttons labeled 'All', 'Local', 'Google'; the 'Google' button is only rendered when googleCalendar.isConnected is true",
        "sourceFilter is applied AFTER colorFilteredEvents and BEFORE searchQuery: sourceFilteredEvents = sourceFilter === 'all' ? colorFilteredEvents : colorFilteredEvents.filter(e => e.source === sourceFilter)",
        "filteredEvents (the final array passed to CalendarGrid) is the result of applying color then source then search in that order",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Match ViewToggle's exact className pattern — do not extract a shared component, just inline the same classes in DashboardPage."
    },
    {
      "id": "US-003",
      "title": "Mini month navigator widget in dashboard sidebar",
      "description": "As a user, I want a compact month calendar in the sidebar so I can jump to any date without repeatedly clicking the arrow buttons on the main calendar.",
      "acceptanceCriteria": [
        "src/components/MiniMonthNav.tsx exists and exports a default MiniMonthNav component",
        "It reads selectedDate and setSelectedDate from useAppStore — no props required for date state",
        "Internal viewMonth state (initialized to selectedDate's month/year) is controlled by ◀ ▶ arrow buttons that decrement/increment the displayed month",
        "A header row displays 3-letter day abbreviations (Su Mo Tu We Th Fr Sa) in text-xs text-gray-500 text-center",
        "A grid of day cells renders for the displayed month; days outside the month are rendered but dimmed (text-gray-300) and are not clickable",
        "Today's cell (matching new Date()) has ring-2 ring-orange-500 ring-offset-1",
        "The cell matching selectedDate has bg-orange-500 text-white text-xs font-bold (overrides the today ring if both apply to the same cell)",
        "Clicking an in-month day calls setSelectedDate(new Date(year, month, day, selectedDate.getHours(), selectedDate.getMinutes()))",
        "The component uses the frosted-glass card wrapper: bg-white/90 backdrop-blur-sm shadow-sm rounded-xl border border-gray-200",
        "DashboardPage renders <MiniMonthNav /> at the top of the sidebar column, before NotificationPanel",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Rewrite UpcomingEvents into a grouped Today / Tomorrow / Later summary",
      "description": "As a user, I want my sidebar event list grouped by day so I can quickly scan what is happening today, tomorrow, and later this week.",
      "acceptanceCriteria": [
        "UpcomingEvents.tsx imports expandRecurrence from '../utils/expandRecurrence.ts' and internally computes expanded = expandRecurrence(events, todayMidnight, sevenDaysFromNow) so recurring instances are resolved",
        "The expanded events are partitioned into three groups: Today (start >= todayMidnight and start < tomorrowMidnight), Tomorrow (start >= tomorrowMidnight and start < dayAfterTomorrowMidnight), Later (start >= dayAfterTomorrowMidnight and start < sevenDaysFromNow)",
        "Each non-empty group renders a label header: the group name (Today, Tomorrow, Later) in text-xs font-semibold uppercase text-gray-500 with border-b border-gray-100 below it",
        "Each event row preserves the current layout: colored circle (w-3 h-3 rounded-full with ev.color), title (text-sm font-medium text-gray-800 truncate), and time below (text-xs text-gray-400 using toLocaleTimeString shorthand)",
        "Events within each group are sorted by start ascending; at most 3 events are rendered per group; if a group has more than 3 a '+N more' link (text-xs text-orange-600) appears after the third row",
        "Groups with zero events are omitted entirely — no empty-state row per group",
        "When ALL groups are empty the card shows a single 'No upcoming events' message (text-sm text-gray-400 text-center inside a p-4 div)",
        "The card title 'Upcoming' and the frosted-glass card wrapper remain unchanged",
        "DashboardPage continues to pass allEvents to UpcomingEvents — no change at the call site",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 3,
      "passes": false,
      "notes": "UpcomingEvents now expands recurrences internally for its own 7-day window so recurring instances appear in the summary regardless of what date range the main calendar is showing."
    },
    {
      "id": "US-005",
      "title": "Persist active filters in URL search params",
      "description": "As a user, I want filter state (search query, color chips, source toggle) saved in the URL so I can share a filtered calendar view or return to it via the browser back button.",
      "acceptanceCriteria": [
        "DashboardPage reads searchQuery, colors (comma-separated hex strings), and source from useSearchParams on initial mount and uses them to initialize the corresponding state variables (searchQuery, activeColors, sourceFilter)",
        "Whenever searchQuery, activeColors, or sourceFilter changes DashboardPage calls setSearchParams; default/empty values are omitted from the URL: no searchQuery param when empty string, no colors param when activeColors is [], no source param when sourceFilter is 'all'",
        "The existing google=connected detection is preserved: when present it is consumed by deleting only that key from a new URLSearchParams copy (not by calling setSearchParams({})) so that sibling filter params survive",
        "A round-trip works: setting filters, copying the URL, opening it in a new tab causes those filters to be pre-applied",
        "No additional dependencies added; useSearchParams (already imported) is the only hook used",
        "Frontend typecheck passes: npm run build"
      ],
      "priority": 4,
      "passes": false,
      "notes": "useSearchParams is already imported in DashboardPage for the google=connected flow. Extend that usage. The google=connected useEffect must be updated to preserve other params when clearing that one param."
    }
  ]
}
